package ru.mirea.work25.task3;

import java.util.regex.Pattern;

public class DateChecker {
    public static void main(String[] args) {

        // 31/(?:0[13578]|1[02]) - 31 день
        // (29|30)/(?:0[13-9]|1[0-2]) - 30 дней
        // (?:0[1-9]|1\d|2[0-8])/(?:0[1-9]|1[0-2]) c 28 днями
        // /(?:19\d{2}|[2-9]\d{3})$ - 1900 до 9999
        //29/02/(?:(?:19|[2-9]\d)(?:0[48]|[2468][048]|[13579][26])|2000)$ - 29 февраля только високосные

        String regex = "^(?:(?:31/(?:0[13578]|1[02]))|(?:29|30/(?:0[13-9]|1[0-2]))|(?:0[1-9]|1" +
                "\\d|2[0-8])/(?:0[1-9]|1[0-2]))/(?:19" +
                "\\d{2}|[2-9]\\d{3})$|^29/02/(?:(?:19|[2-9]" +
                "\\d)(?:0[48]|[2468][048]|[13579][26])|2000)$";

        String[] dates = {
                "29/02/2000", // Високосный год
                "30/04/2003", // Правильная дата
                "01/01/2003", // Правильная дата
                "29/02/2001", // Невисокосный год
                "30-04-2003", // Неправильный формат
                "1/1/1899"    // Год меньше 1900
        };

        Pattern pattern = Pattern.compile(regex);
        for (String date : dates) {
            boolean isValid = pattern.matcher(date).matches();
            System.out.println(date + " : " + (isValid ? "date is valid" : "date is invalid"));
        }
    }
}